backend/artwitter_api/app/controllers/arts_controller.rb

SELECT "arts".* FROM "arts"
---
  def index
    @arts = Art.all

INSERT INTO "arts" ("title", "artist_name", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @art = Art.new(art_params)

    if @art.save

SELECT "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_art
      @art = Art.find(params[:id])