backend/artwitter_api/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "name", "art_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "content"], ["name", "name of user"], ["art_id", 1], ["created_at", "2021-03-01 03:00:59.887231"], ["updated_at", "2021-03-01 03:00:59.887231"]]
---
  def create
    @comment = Comment.new(comment_params)

    if @comment.save

SELECT "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_art
      @art = Art.find(params[:art_id])