backend/artwitter_api/app/controllers/comments_controller.rb

    def set_art
      @art = Art.find(params[:art_id])
---
SELECT "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]